In [1]:
import pandas as pd

### Import the dataset 'Salaries.csv'.

In [4]:
df = pd.read_csv('Salaries.csv')

In [2]:
df=pd.read_excel("Salaries.xlsx")

### Display how many rows and how many columns.

In [3]:
df.shape

(78, 6)

###  Display first 10 rows and last 15 rows.

In [4]:
df.head(10)

        rank discipline   phd  service   sex    salary
0       Prof          B  56.0       49  Male  186960.0
1       Prof          A  12.0        6  Male   93000.0
2       Prof          A  23.0       20  Male  110515.0
3       Prof          A  40.0       31  Male  131205.0
4       Prof          B  20.0       18  Male  104800.0
5       Prof          A  20.0       20  Male  122400.0
6  AssocProf          A  20.0       17  Male   81285.0
7       Prof          A  18.0       18  Male       NaN
8       Prof          A  29.0       19  Male   94350.0
9       Prof          A  51.0       51  Male   57800.0

In [5]:
df.tail(15)

         rank discipline   phd  service     sex    salary
63       Prof          A  29.0       27  Female   91000.0
64  AssocProf          A  26.0       24  Female   73300.0
65       Prof          A  36.0       19  Female  117555.0
66   AsstProf          A   7.0        6  Female   63100.0
67       Prof          A  17.0       11  Female   90450.0
68   AsstProf          A   4.0        2  Female   77500.0
69       Prof          A  28.0        7  Female  116450.0
70   AsstProf          A   8.0        3  Female   78500.0
71  AssocProf          B  12.0        9  Female   71065.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

### Which Male and Female Professor has the highest and the lowest salaries?

In [6]:
male = df.loc[df['sex']=='Male']
male['salary'].max()

186960.0

In [7]:
female = df.loc[df['sex']=='Female']
female['salary'].max()

161101.0

### Which Professor takes the highest and lowest salaries?

In [31]:
max_salary=df['salary'].max()
max_sal_rank=df.loc[df['salary']==max_salary]
max_sal_rank['rank']

0    Prof
Name: rank, dtype: object

### Missing 'Salaries' - should be replaced as mean of the matching salaries of those whose 'service' is the same

In [9]:
df['salary'].fillna(df.groupby('service')['salary'].transform('mean'), inplace=True)
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

### Missing 'phd' - should be replaced as mean of the matching 'service'

In [ ]:
df['phd'].fillna(df.groupby('service')['phd'].transform('mean'), inplace=True)

### How many are Male Staff and how many are Female Staff

In [12]:
male = df['sex'].value_counts()['Male']
female = df['sex'].value_counts()['Female']
print("Male: ",male)
print("Female: ",female)

Male:  39
Female:  39

### How many are Prof, AssocProf and AsstProf

In [14]:
df["rank"].unique()
Prof=df["rank"].value_counts()["Prof"]
AssocP = df["rank"].value_counts()["AssocProf"]
AsstP = df["rank"].value_counts()["AsstProf"]
print("Prof: ",Prof)
print("AssocProf:",AssocP)
print("AsstProf:",AsstP)

Prof:  46
AssocProf: 13
AsstProf: 19

### Who are the senior and junior most employees in the organization

In [18]:
senior_employee = df[df['service']==df['service'].max()]
print(senior_employee)
# Junior most employee
junior_employee = df[df['service']==df['service'].min()]
print(junior_employee)

   rank discipline   phd  service   sex   salary
9  Prof          A  51.0       51  Male  57800.0
        rank discipline   phd  service     sex    salary
12  AsstProf          B   1.0        0    Male   88000.0
17  AsstProf          B   4.0        0    Male   92000.0
23  AsstProf          A   2.0        0    Male   85000.0
43  AsstProf          B   5.0        0  Female   77000.0
52      Prof          A  12.0        0  Female  105000.0
55  AsstProf          A   2.0        0  Female   72500.0